toko-api/app/Controllers/ProdukController.php

SELECT *
FROM `produk`
---
    public function list(){
        $model = new MProduk();
        $produk = $model->findAll();

SELECT *
FROM `produk`
WHERE `produk`.`id` = '1'
---
    public function detail($id){
        $model = new MProduk();
        $produk = $model->find($id);